"""
Реализуйте функции для работы со строками.
Не меняйте названия функций.

Обратите внимание!:
В каждой функции уже есть параметр s — это строка, которая будет передана в функцию при вызове.
Создавать переменную s внутри функции НЕ нужно: она уже существует и содержит нужное значение.

Например, если бы у нас была такая функция:

def print_text(t: str):
    print(t)

То при вызове print_text("Привет") параметр t автоматически получит строку "Привет".
Нам не нужно писать t = "Привет" внутри функции — значение уже передаётся извне.

Точно так же в заданиях ниже вы можете сразу работать со строкой s.

"""

def get_first_and_last_char(s: str) -> str:
    """
    Возвращает строку, состоящую из первого и последнего символа s.
    Пример: "hello" -> "ho"
    """
    # TODO: Напишите ваш код здесь
    return s[0] + s[-1]

def get_middle_chars(s: str) -> str:
    """
    Возвращает все символы строки s, кроме первого и последнего.
    Пример: "hello" -> "ell"
    """
    # TODO: Напишите ваш код здесь
    ...
    return s[1:-1]

def reverse_string(s: str) -> str:
    """
    Возвращает строку s в обратном порядке.
    Пример: "hello" -> "olleh"
    """
    # TODO: Напишите ваш код здесь
    ...
    return s[::-1]

def is_palindrome(s: str) -> bool:
    """
    Проверяет, является ли строка s палиндромом.
    Возвращает True или False.
    Палиндром — это слово или фраза, которые читаются одинаково в обоих направлениях.
    Пример: "racecar" -> True, "hello" -> False
    """
    # TODO: Напишите ваш код здесь
    ...
    return s == s[::-1]

def count_vowels(s: str) -> int:
    """
    Считает количество гласных букв (a, e, i, o, u) в строке s.
    Регистр букв не должен иметь значения.
    Пример: "Hello World" -> 3
    """
    glas_b = "AEIOUaeiou"   
    count = 0          
    s = s.lower()
    for i in s:     
        if i in glas_b:
            count += 1

    return count 

def remove_spaces(s: str) -> str:
    """
    Удаляет все пробелы из строки s.
    Пример: "hello world" -> "helloworld"
    """
    result = ""
    for i in s:
        if i == " ":
            continue
        else:
            result += i
    return result

def capitalize_words(s: str) -> str:
    """
    Делает заглавной первую букву каждого слова в строке s.
    Пример: "hello world" -> "Hello World"
    """
    # TODO: Напишите ваш код здесь
    ...
    return s.title()
